Repository: Scille/parsec
Catalog: docs/locale/*/LC_MESSAGES/roles.po
Languages: fr

source: Roles
fr: Rôle

source: User management
fr: Gestion des utilisateurs

source: There are two profiles for user management :
fr: Il existe deux profils pour la gestion des utilisateurs :

source: The User profile enables
fr: Utilisateur permet :

source: the creation of a Workspace;
fr: la création d’un workspace;

source: the management of documentation (creation, modification, history, integrity information);
fr: la gestion de la documentation (création, modification, historique, informations sur l’intégrité);

source: the sharing of data inside a Workspace;
fr: le partage des données au sein d’un workspace;

source: the creation of its own devices.
fr: la création de ses propres terminaux.

source: The Administrator profile enables
fr: Administrateur permet

source: every roles of the User profile;
fr: tous les rôles du profil Utilisateur;

source: the creation of other users (whether Administrator or User)
fr: la création d’autres utilisateurs (Administrateur ou Utilisateur);

source: the deletion of whichever User whatever his profile.
fr: la suppression de n’importe quel Utilisateur quelque soit son profil.

source: It isn't possible to modify a profile : an Administrator will stay an Administrator; an User will stay an User.
fr: Il n’est pas possible de modifier un profil : un Administrateur restera un Administrateur; un Utilisateur restera un Utilisateur.

source: In that case of modification, it is required, after deletion, to create a new user and allocate him the new role.
fr: Dans ce cas de modification, il faut, après suppression, créer un nouvel utilisateur et lui allouer le nouveau rôle souhaité.

source: Device management
fr: Gestion des terminaux

source: Only the user, whatever his profile, can create an undetermined number of devices for himself.
fr: Seul l’utilisateur, quelque soit son profil, peut se créer un un nombre quelconque de terminaux (ou device).

source: Every devices are clones. The number of devices by user is usually small.
fr: Tous les terminaux sont des clones. Le nombre de terminaux par utilisateur est généralement faible.

source: The deletion of on device only is not possible. When a user is deleted, all his devices are deleted.
fr: La suppression d’un seul terminal est impossible. Lorsqu'un utilisateur est supprimé, tous ses terminaux sont supprimés.

source: Management of Workspaces and Documents
fr: Gestion des workspaces et des documents

source: There are four roles having different rights in a workspace :
fr: Il existe quatre rôles ayant des droits différents au sein d’un workspace :

source: Reader : he only has read access.
fr: Lecteur : il ne dispose des accès qu’en lecture.

source: Manager : he can give rights except the one of owner. He has read and write access.
fr: Gérant : il peut donner les droits sauf celui de propriétaire. Il a accès en lecture et en écriture.

source: Owner : he can give rights including the one of Owner. There can be multiple owners.
fr: Propriétaire : il peut donner tous les droits y compris celui de propriétaire. Il peut y avoir plusieurs propriétaires.

source: The Workspace creator is Owner by default. He has read and write access.
fr: Le créateur du workspace est propriétaire par défaut. Il a accès en lecture et en écriture.

source: Only an Owner can trigger a complete Workspace re-encryption in case of the prior deletion of an user (for example consecutive to the compromise of a device or an user).
fr: Seul un Propriétaire peut enclencher un re-chiffrement intégral des métadonnées de le workspace en cas de suppression préalable d’un utilisateur (consécutive par exemple à la compromission d’un terminal ou à la compromission d’un utilisateur).
